'''
멀리뛰기_s1 은 메모이제이션 => 성공
멀리뛰기_s2 은 재귀 => 시간초과
'''

def func(N):
    dp = [0] * (N + 1)
    dp[1] = 1
    if N >= 2: dp[2] = 2

    if N >= 3:
        for i in range(3, N + 1):
            dp[i] = dp[i - 1] + dp[i - 2]
    return dp

# dp = [0, 1, 2, 3, 5, 8, 13 , ...]

def solution(n):
    dp = func(n)
    answer = dp[n] % 1_234_567

    return answer

# 2 칸
# 1 + 1
# 2

# 3 칸
# 1 + 1 + 1
# 1 + 2
# 2 + 1

# 4 칸
# 1 + 1 + 1 + 1
# 1 + 1 + 2
# 1 + 2 + 1
# 2 + 1 + 1
# 2 + 2

# 5 칸
# 1 + 1 + 1 + 1 + 1
# 1 + 1 + 2 + 1
# 1 + 2 + 1 + 1
# 2 + 1 + 1 + 1
# 2 + 2 + 1

# 1 + 1 + 1 + 2
# 1 + 2 + 2
# 2 + 1 + 2